rav4_hybrid = {
    "модель": "Toyota RAV4 Hybrid Style 2025",
    "ціна": 2026125,  # грн
    "робочий_обєм_двигуна": "2.5 л Hybrid",
    "повна_маса": "2220 кг",
    "максимальна_швидкість": "180 км/год",
    "витрата_пального_на_100км": 5.8,  # л/100 км
    "інтерєр": [
        "Smart Entry and Start",
        "Безконтактне керування дверима багажника",
        "Дзеркало з автозатемненням"
    ],
    "багажник": {
        "обєм": "580 л",
        "зі_складеними_сидіннями": "1690 л"
    }
}

rav4_hybrid["макс_маса_причепа_з_гальмами"] = 1650


print("Назва авто:", rav4_hybrid["модель"])
print("Ціна:", rav4_hybrid["ціна"], "грн")
print("Перша опція інтер'єру:", rav4_hybrid["інтерєр"][0])
print("Об'єм багажника зі складеними сидіннями:", rav4_hybrid["багажник"]["зі_складеними_сидіннями"])


strahovka = rav4_hybrid["ціна"] * 0.005
rav4_hybrid["страховий_платіж"] = round(strahovka)
print("Страховий платіж:", rav4_hybrid["страховий_платіж"], "грн")

# вартість поїздки на 200 км
litry = 2000 / 1000 * rav4_hybrid["витрата_пального_на_100км"]
cena_poezdki = litry * 93
print("Вартість поїздки на 200 км:", round(cena_poezdki), "грн")
